# A191 Stock Factors 061-080

In [1]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [2]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 061

Formula:

`(MAX(RANK(DECAYLINEAR(DELTA(VWAP, 1), 12)),RANK(DECAYLINEAR(RANK(CORR((LOW),MEAN(VOLUME,80), 8)), 17))) * -1)`

In [3]:
sql_alpha_061 = f"""--sql
SELECT
    date,
    instrument,
    (greatest(c_pct_rank(m_decay_linear(m_delta(vwap, 1), 12)),
              c_pct_rank(m_decay_linear(c_pct_rank(m_corr((low),m_avg(volume,80), 8)), 17))) * -1) 
    AS alpha_a191_f0061
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_061), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0061
65895   2023-01-20  000001.SZ         -0.648925
65896   2023-01-20  000002.SZ         -0.092938
65897   2023-01-20  000004.SZ         -0.636233
65898   2023-01-20  000005.SZ         -0.248516
65899   2023-01-20  000006.SZ         -0.117298
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.244492
3858341 2025-12-26  688800.SH         -0.972842
3858345 2025-12-26  688819.SH         -0.784093
3858346 2025-12-26  688981.SH         -0.972260
3858347 2025-12-26  689009.SH         -0.173523

[3605214 rows x 3 columns]

## A191 Factor 062

Formula:

`(-1 * CORR(HIGH, RANK(VOLUME), 5))`

In [4]:
sql_alpha_062 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_corr(high, c_pct_rank(volume), 5)) 
    AS alpha_a191_f0062
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_062), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0062
25337   2023-01-10  000001.SZ          0.693197
25338   2023-01-10  000002.SZ         -0.519993
25339   2023-01-10  000004.SZ         -0.547057
25340   2023-01-10  000005.SZ         -0.809732
25341   2023-01-10  000006.SZ         -0.965145
...            ...        ...               ...
3858342 2025-12-26  688802.SH         -0.391507
3858344 2025-12-26  688807.SH         -0.484445
3858345 2025-12-26  688819.SH         -0.152458
3858346 2025-12-26  688981.SH          0.443143
3858347 2025-12-26  689009.SH          0.546204

[3647201 rows x 3 columns]

## A191 Factor 063

Formula:

`SMA(MAX(CLOSE-DELAY(CLOSE,1),0),6,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),6,1)*100`

In [5]:
sql_alpha_063 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(greatest(close-m_lag(close,1),0),6,1) /
    m_ta_ewm(abs(close-m_lag(close,1)),6,1) * 100 
    AS alpha_a191_f0063
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_063), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0063
10134   2023-01-05  000001.SZ         16.666667
10135   2023-01-05  000002.SZ         16.666667
10136   2023-01-05  000004.SZ          0.000000
10137   2023-01-05  000005.SZ         16.666667
10138   2023-01-05  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.000000
3858344 2025-12-26  688807.SH         21.569281
3858345 2025-12-26  688819.SH         72.104076
3858346 2025-12-26  688981.SH         67.685516
3858347 2025-12-26  689009.SH         36.137359

[3663217 rows x 3 columns]

## A191 Factor 064

Formula:

`(MAX(RANK(DECAYLINEAR(CORR(RANK(VWAP), RANK(VOLUME), 4), 4)),RANK(DECAYLINEAR(MAX(CORR(RANK(CLOSE), RANK(MEAN(VOLUME,60)), 4), 13), 14))) * -1)`

In [6]:
sql_alpha_064 = f"""--sql
SELECT
    date,
    instrument,
    (greatest(c_pct_rank(m_decay_linear(m_corr(c_pct_rank(vwap), c_pct_rank(volume), 4), 4)),
              c_pct_rank(m_decay_linear(greatest(m_corr(c_pct_rank(close),
                                                        c_pct_rank(m_avg(volume,60)), 4), 13), 14))) * -1) 
    AS alpha_a191_f0064
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_064), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0064
35474   2023-01-12  000001.SZ         -0.098733
35475   2023-01-12  000002.SZ         -0.413123
35476   2023-01-12  000004.SZ         -0.219133
35477   2023-01-12  000005.SZ         -0.819092
35478   2023-01-12  000006.SZ         -0.926410
...            ...        ...               ...
3858341 2025-12-26  688800.SH         -0.512796
3858342 2025-12-26  688802.SH         -0.215587
3858345 2025-12-26  688819.SH         -0.499709
3858346 2025-12-26  688981.SH         -0.688251
3858347 2025-12-26  689009.SH         -0.499709

[3636993 rows x 3 columns]

## A191 Factor 065

Formula:

`MEAN(CLOSE,6)/CLOSE`

In [7]:
sql_alpha_065 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(close,6)/close 
    AS alpha_a191_f0065
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_065), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0065
30405   2023-01-11  000001.SZ          0.992161
30406   2023-01-11  000002.SZ          1.002194
30407   2023-01-11  000004.SZ          1.037732
30408   2023-01-11  000005.SZ          1.023679
30409   2023-01-11  000006.SZ          1.023222
...            ...        ...               ...
3858341 2025-12-26  688800.SH          0.942492
3858342 2025-12-26  688802.SH          1.067681
3858345 2025-12-26  688819.SH          0.976527
3858346 2025-12-26  688981.SH          0.986309
3858347 2025-12-26  689009.SH          1.026698

[3642292 rows x 3 columns]

## A191 Factor 066

Formula:

`(CLOSE-MEAN(CLOSE,6))/MEAN(CLOSE,6)*100`

In [8]:
sql_alpha_066 = f"""--sql
SELECT
    date,
    instrument,
    (close-m_avg(close,6))/m_avg(close,6)*100 
    AS alpha_a191_f0066
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_066), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0066
30405   2023-01-11  000001.SZ          0.790106
30406   2023-01-11  000002.SZ         -0.218933
30407   2023-01-11  000004.SZ         -3.636050
30408   2023-01-11  000005.SZ         -2.313167
30409   2023-01-11  000006.SZ         -2.269463
...            ...        ...               ...
3858341 2025-12-26  688800.SH          6.101750
3858342 2025-12-26  688802.SH         -6.339030
3858345 2025-12-26  688819.SH          2.403774
3858346 2025-12-26  688981.SH          1.388101
3858347 2025-12-26  689009.SH         -2.600405

[3642292 rows x 3 columns]

## A191 Factor 067

Formula:

`SMA(MAX(CLOSE-DELAY(CLOSE,1),0),24,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),24,1)*100`

In [9]:
sql_alpha_067 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(greatest(close-m_lag(close,1),0),24,1) /
    m_ta_ewm(abs(close-m_lag(close,1)),24,1) * 100 
    AS alpha_a191_f0067
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_067), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0067
10134   2023-01-05  000001.SZ          4.166667
10135   2023-01-05  000002.SZ          4.166667
10136   2023-01-05  000004.SZ          0.000000
10137   2023-01-05  000005.SZ          4.166667
10138   2023-01-05  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.000000
3858344 2025-12-26  688807.SH          8.537173
3858345 2025-12-26  688819.SH         57.100318
3858346 2025-12-26  688981.SH         55.058084
3858347 2025-12-26  689009.SH         44.690317

[3663217 rows x 3 columns]

## A191 Factor 068

Formula:

`SMA(((HIGH+LOW)/2-(DELAY(HIGH,1)+DELAY(LOW,1))/2)*(HIGH-LOW)/VOLUME,15,2)`

In [10]:
sql_alpha_068 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(((high+low)/2-(m_lag(high,1)+m_lag(low,1))/2)*(high-low)/volume,15,2) 
    AS alpha_a191_f0068
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_068), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0068
10134   2023-01-05  000001.SZ      1.528537e-05
10135   2023-01-05  000002.SZ      1.265037e-04
10136   2023-01-05  000004.SZ     -2.576975e-08
10137   2023-01-05  000005.SZ      2.689646e-08
10138   2023-01-05  000006.SZ     -7.652857e-07
...            ...        ...               ...
3858343 2025-12-26  688805.SH     -2.103616e-07
3858344 2025-12-26  688807.SH     -3.788785e-05
3858345 2025-12-26  688819.SH      4.462878e-08
3858346 2025-12-26  688981.SH      4.220314e-08
3858347 2025-12-26  689009.SH     -8.109476e-09

[3663499 rows x 3 columns]

## A191 Factor 069

Formula:

`(SUM(DTM,20)>SUM(DBM,20)?(SUM(DTM,20)-SUM(DBM,20))/SUM(DTM,20):(SUM(DTM,20)=SUM(DBM,20)?0:(SUM(DTM,20)-SUM(DBM,20))/SUM(DBM,20)))`

In [11]:
sql_alpha_069 = f"""--sql
SELECT
    date,
    instrument,
    (IF(m_sum(DTM,20)>m_sum(DBM,20),(m_sum(DTM,20)-m_sum(DBM,20))/m_sum(DTM,20),
        IF(m_sum(DTM,20)=m_sum(DBM,20),0,(m_sum(DTM,20)-m_sum(DBM,20))/m_sum(DBM,20)))) 
    AS alpha_a191_f0069
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_069), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0069
101438  2023-02-07  000001.SZ          0.419263
101439  2023-02-07  000002.SZ          0.347932
101440  2023-02-07  000004.SZ          0.547826
101441  2023-02-07  000005.SZ          0.633333
101442  2023-02-07  000006.SZ         -0.491667
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.415663
3858341 2025-12-26  688800.SH          0.742696
3858345 2025-12-26  688819.SH          0.602386
3858346 2025-12-26  688981.SH          0.757669
3858347 2025-12-26  689009.SH          0.545455

[3568164 rows x 3 columns]

## A191 Factor 070

Formula:

`STD(AMOUNT,6)`

In [12]:
sql_alpha_070 = f"""--sql
SELECT
    date,
    instrument,
    m_stddev(amount,6) 
    AS alpha_a191_f0070
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_070), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0070
30405   2023-01-11  000001.SZ      6.777697e+08
30406   2023-01-11  000002.SZ      3.760541e+08
30407   2023-01-11  000004.SZ      4.171117e+06
30408   2023-01-11  000005.SZ      4.197395e+06
30409   2023-01-11  000006.SZ      2.224159e+08
...            ...        ...               ...
3858341 2025-12-26  688800.SH      5.330782e+08
3858342 2025-12-26  688802.SH      9.093263e+08
3858345 2025-12-26  688819.SH      1.757630e+07
3858346 2025-12-26  688981.SH      2.258872e+09
3858347 2025-12-26  689009.SH      1.367334e+08

[3642292 rows x 3 columns]

## A191 Factor 071

Formula:

`(CLOSE-MEAN(CLOSE,24))/MEAN(CLOSE,24)*100`

In [13]:
sql_alpha_071 = f"""--sql
SELECT
    date,
    instrument,
    (close-m_avg(close,24))/m_avg(close,24)*100 
    AS alpha_a191_f0071
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_071), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0071
121771  2023-02-13  000001.SZ         -5.307334
121772  2023-02-13  000002.SZ         -3.821367
121773  2023-02-13  000004.SZ          1.791333
121774  2023-02-13  000005.SZ         -1.568803
121775  2023-02-13  000006.SZ          3.002757
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.418214
3858341 2025-12-26  688800.SH         11.124080
3858345 2025-12-26  688819.SH          4.182675
3858346 2025-12-26  688981.SH          5.743277
3858347 2025-12-26  689009.SH         -1.766205

[3547007 rows x 3 columns]

## A191 Factor 072

Formula:

`SMA((TSMAX(HIGH,6)-CLOSE)/(TSMAX(HIGH,6)-TSMIN(LOW,6))*100,15,1)`

In [14]:
sql_alpha_072 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm((m_max(high,6)-close)/(m_max(high,6)-m_min(low,6))*100,15,1) 
    AS alpha_a191_f0072
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_072), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0072
30405   2023-01-11  000001.SZ         17.460317
30406   2023-01-11  000002.SZ         43.209877
30407   2023-01-11  000004.SZ         98.591549
30408   2023-01-11  000005.SZ         92.307692
30409   2023-01-11  000006.SZ         88.372093
...            ...        ...               ...
3858341 2025-12-26  688800.SH         47.955608
3858342 2025-12-26  688802.SH         83.709169
3858345 2025-12-26  688819.SH         49.037953
3858346 2025-12-26  688981.SH         43.850787
3858347 2025-12-26  689009.SH         48.628943

[3642292 rows x 3 columns]

## A191 Factor 073

Formula:

`((TSRANK(DECAYLINEAR(DECAYLINEAR(CORR((CLOSE), VOLUME, 10), 16), 4), 5) - RANK(DECAYLINEAR(CORR(VWAP, MEAN(VOLUME,30), 4),3))) * -1)`

In [15]:
sql_alpha_073 = f"""--sql
SELECT
    date,
    instrument,
    ((m_rank(m_decay_linear(m_decay_linear(m_corr((close), volume, 10), 16), 4), 5) -
      c_pct_rank(m_decay_linear(m_corr(vwap, m_avg(volume,30), 4),3))) * -1) 
    AS alpha_a191_f0073
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_073), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0073
177792  2023-02-28  000001.SZ         -4.246916
177793  2023-02-28  000002.SZ         -4.334498
177794  2023-02-28  000004.SZ         -0.537418
177795  2023-02-28  000005.SZ         -4.689145
177796  2023-02-28  000006.SZ         -3.206826
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -4.161748
3858341 2025-12-26  688800.SH         -4.337670
3858345 2025-12-26  688819.SH         -4.947961
3858346 2025-12-26  688981.SH         -4.254563
3858347 2025-12-26  689009.SH         -0.701942

[3488854 rows x 3 columns]

## A191 Factor 074

Formula:

`(RANK(CORR(SUM(((LOW * 0.35) + (VWAP * 0.65)), 20), SUM(MEAN(VOLUME,40), 20), 7)) + RANK(CORR(RANK(VWAP), RANK(VOLUME), 6)))`

In [16]:
sql_alpha_074 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(m_sum(((low * 0.35) + (vwap * 0.65)), 20),
                       m_sum(m_avg(volume,40), 20), 7)) +
     c_pct_rank(m_corr(c_pct_rank(vwap), c_pct_rank(volume), 6))) 
    AS alpha_a191_f0074
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_074), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0074
331445  2023-04-12  000001.SZ          0.671347
331446  2023-04-12  000002.SZ          0.834989
331447  2023-04-12  000004.SZ          0.750990
331448  2023-04-12  000005.SZ          1.366633
331449  2023-04-12  000006.SZ          1.607321
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.862587
3858341 2025-12-26  688800.SH          1.632735
3858345 2025-12-26  688819.SH          0.204163
3858346 2025-12-26  688981.SH          0.960991
3858347 2025-12-26  689009.SH          0.127877

[3330587 rows x 3 columns]

## A191 Factor 075

Formula:

`COUNT(CLOSE>OPEN &BANCHMARKINDEXCLOSE<BANCHMARKINDEXOPEN,50)/COUNT(BANCHMARKINDEXCLOSE<BANCHMARKINDEXOPEN,50)`

In [17]:
sql_alpha_075 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close > open AND bm_close < bm_open, 1, 0), 50) /
    m_sum(IF(bm_close < bm_open, 1, 0), 50) 
    AS alpha_a191_f0075
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_075), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0075
254463  2023-03-21  000001.SZ          0.200000
254464  2023-03-21  000002.SZ          0.320000
254465  2023-03-21  000004.SZ          0.440000
254466  2023-03-21  000005.SZ          0.360000
254467  2023-03-21  000006.SZ          0.320000
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.210526
3858341 2025-12-26  688800.SH          0.315789
3858345 2025-12-26  688819.SH          0.263158
3858346 2025-12-26  688981.SH          0.315789
3858347 2025-12-26  689009.SH          0.421053

[3409669 rows x 3 columns]

## A191 Factor 076

Formula:

`STD(ABS((CLOSE/DELAY(CLOSE,1)-1))/VOLUME,20)/MEAN(ABS((CLOSE/DELAY(CLOSE,1)-1))/VOLUME,20)`

In [18]:
sql_alpha_076 = f"""--sql
SELECT
    date,
    instrument,
    m_stddev(abs((close/m_lag(close,1)-1))/volume,20) /
    m_avg(abs((close/m_lag(close,1)-1))/volume,20) 
    AS alpha_a191_f0076
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_076), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0076
106518  2023-02-08  000001.SZ          0.618484
106519  2023-02-08  000002.SZ          0.694660
106520  2023-02-08  000004.SZ          0.548081
106521  2023-02-08  000005.SZ          0.869006
106522  2023-02-08  000006.SZ          0.714879
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.687623
3858341 2025-12-26  688800.SH          0.651516
3858345 2025-12-26  688819.SH          0.788192
3858346 2025-12-26  688981.SH          0.671555
3858347 2025-12-26  689009.SH          0.563803

[3562874 rows x 3 columns]

## A191 Factor 077

Formula:

`MIN(RANK(DECAYLINEAR(((((HIGH + LOW) / 2) + HIGH) -(VWAP + HIGH)), 20)),RANK(DECAYLINEAR(CORR(((HIGH + LOW) / 2), MEAN(VOLUME,40), 3), 6)))`

In [19]:
sql_alpha_077 = f"""--sql
SELECT
    date,
    instrument,
    least(c_pct_rank(m_decay_linear(((((high + low) / 2) + high) -(vwap + high)), 20)),
          c_pct_rank(m_decay_linear(m_corr(((high + low) / 2), m_avg(volume,40), 3), 6))) 
    AS alpha_a191_f0077
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_077), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0077
101438  2023-02-07  000001.SZ          0.995487
101439  2023-02-07  000002.SZ          0.997128
101440  2023-02-07  000004.SZ          0.659692
101441  2023-02-07  000005.SZ          0.486769
101442  2023-02-07  000006.SZ          0.956103
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.546478
3858341 2025-12-26  688800.SH          0.806520
3858345 2025-12-26  688819.SH          0.181023
3858346 2025-12-26  688981.SH          0.001747
3858347 2025-12-26  689009.SH          0.120747

[3568164 rows x 3 columns]

## A191 Factor 078

Formula:

`((HIGH+LOW+CLOSE)/3-MA((HIGH+LOW+CLOSE)/3,12))/(0.015*MEAN(ABS(CLOSE-MEAN((HIGH+LOW+CLOSE)/3,12)),12))`

In [20]:
sql_alpha_078 = f"""--sql
SELECT
    date,
    instrument,
    ((high+low+close)/3-m_avg((high+low+close)/3,12)) /
    (0.015*m_avg(abs(close-m_avg((high+low+close)/3,12)),12)) 
    AS alpha_a191_f0078
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_078), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0078
116685  2023-02-10  000001.SZ        -85.466355
116686  2023-02-10  000002.SZ        -40.101649
116687  2023-02-10  000004.SZ         -6.029285
116688  2023-02-10  000005.SZ        -60.992908
116689  2023-02-10  000006.SZ        166.459627
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -9.978188
3858341 2025-12-26  688800.SH        113.106674
3858345 2025-12-26  688819.SH         90.184073
3858346 2025-12-26  688981.SH        112.103983
3858347 2025-12-26  689009.SH        -22.506806

[3552296 rows x 3 columns]

## A191 Factor 079

Formula:

`SMA(MAX(CLOSE-DELAY(CLOSE,1),0),12,1)/SMA(ABS(CLOSE-DELAY(CLOSE,1)),12,1)*100`

In [21]:
sql_alpha_079 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(greatest(close-m_lag(close,1),0),12,1) /
    m_ta_ewm(abs(close-m_lag(close,1)),12,1) * 100 
    AS alpha_a191_f0079
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_079), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0079
10134   2023-01-05  000001.SZ          8.333333
10135   2023-01-05  000002.SZ          8.333333
10136   2023-01-05  000004.SZ          0.000000
10137   2023-01-05  000005.SZ          8.333333
10138   2023-01-05  000006.SZ          0.000000
...            ...        ...               ...
3858343 2025-12-26  688805.SH          0.000000
3858344 2025-12-26  688807.SH         14.540380
3858345 2025-12-26  688819.SH         62.106265
3858346 2025-12-26  688981.SH         60.738140
3858347 2025-12-26  689009.SH         43.058168

[3663217 rows x 3 columns]

## A191 Factor 080

Formula:

`(VOLUME-DELAY(VOLUME,5))/DELAY(VOLUME,5)*100`

In [22]:
sql_alpha_080 = f"""--sql
SELECT
    date,
    instrument,
    (volume-m_lag(volume,5))/m_lag(volume,5)*100 
    AS alpha_a191_f0080
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_080), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0080
30405   2023-01-11  000001.SZ        -62.069108
30406   2023-01-11  000002.SZ        -38.433998
30407   2023-01-11  000004.SZ        -27.565369
30408   2023-01-11  000005.SZ          2.124644
30409   2023-01-11  000006.SZ        -55.535450
...            ...        ...               ...
3858341 2025-12-26  688800.SH         95.585505
3858342 2025-12-26  688802.SH        -54.708370
3858345 2025-12-26  688819.SH         87.922368
3858346 2025-12-26  688981.SH         47.608048
3858347 2025-12-26  689009.SH        103.430306

[3642292 rows x 3 columns]